# 1 SQLALchemy is a Python library that works across a variety of SQL dialects

In [50]:
# SQLAlchemy
from sqlalchemy import create_engine
import pandas as pd

# 2 Create an engine to connect sqllite
- sqlite doesn't need user and password
- // for absolute path
- /// for relative path

In [5]:
engine = create_engine(f"sqlite:///./Resources/Census_Data.sqlite")

# 3 Create an engine to connect postgresql
- create_engine(f'postgres://[username]:[password]@localhost:5432/employee')

In [5]:
postgres_engine = create_engine(f'postgres://postgres:postgres@localhost:5432/employee')

# 4 Query a database using SQL
- The results type is RowProxy
- Can not print it directly
- use for loop to print

In [38]:
results1 = engine.execute("SELECT * FROM Census_Data")

In [39]:
type(results1)

sqlalchemy.engine.result.ResultProxy

In [40]:
i = 1
for result in results1:
    i += 1
    if i > 5: 
        break
    print(result)

('HOUSTON, TX', 'HOUSTON', 'TX', 3061887, 1775897, 684416, 11586, 230549, 1368287, 54180, 387082, 62520, 100014, 349920, 138882, 42491, 27737, 633609, 1593803, 122895, 67484, 22637, 33.43958333, 32.55, 34.36354167, 56206.5, 32239.52083, 956.7083333, 178233.6842, 29.77573444, -95.41454828)
('CHICAGO, IL', 'CHICAGO', 'IL', 2702091, 1318869, 843633, 7554, 161478, 785374, 32800, 370569, 50202, 100972, 385664, 178511, 54636, 26956, 588639, 1439118, 173087, 45864, 18209, 34.52678571, 33.79821429, 35.14107143, 57735.96429, 38730.83929, 1119.928571, 264739.2857, 41.86783754, -87.67343993)
('BROOKLYN, NY', 'BROOKLYN', 'NY', 2595259, 1126111, 870465, 8744, 297890, 509243, 48934, 389177, 65899, 107313, 348413, 164826, 39328, 17446, 597404, 1297832, 129667, 33644, 14845, 35.17567568, 33.36756757, 36.57837838, 51469.18919, 28309.67568, 1261.783784, 605743.2432, 40.65280511, -73.9565277)
('LOS ANGELES, CA', 'LOS ANGELES', 'CA', 2426413, 1068202, 324842, 15949, 273829, 1292382, 62684, 280325, 22924, 83153, 312270, 104024, 40600, 19436, 626981, 1273305, 141105, 26989, 12329, 35.33548387, 34.53548387, 36.06129032, 47494.58333, 30073.19355, 1201.766667, 557115.0, 34.04220912, -118.3034679)

## fetchall( ) method
- fetchall change the results to list

In [14]:
data = engine.execute("SELECT * FROM Census_Data").fetchall()

In [15]:
type(data)

list

In [17]:
data[:5]

[('HOUSTON, TX', 'HOUSTON', 'TX', 3061887, 1775897, 684416, 11586, 230549, 1368287, 54180, 387082, 62520, 100014, 349920, 138882, 42491, 27737, 633609, 1593803, 122895, 67484, 22637, 33.43958333, 32.55, 34.36354167, 56206.5, 32239.52083, 956.7083333, 178233.6842, 29.77573444, -95.41454828),
 ('CHICAGO, IL', 'CHICAGO', 'IL', 2702091, 1318869, 843633, 7554, 161478, 785374, 32800, 370569, 50202, 100972, 385664, 178511, 54636, 26956, 588639, 1439118, 173087, 45864, 18209, 34.52678571, 33.79821429, 35.14107143, 57735.96429, 38730.83929, 1119.928571, 264739.2857, 41.86783754, -87.67343993),
 ('BROOKLYN, NY', 'BROOKLYN', 'NY', 2595259, 1126111, 870465, 8744, 297890, 509243, 48934, 389177, 65899, 107313, 348413, 164826, 39328, 17446, 597404, 1297832, 129667, 33644, 14845, 35.17567568, 33.36756757, 36.57837838, 51469.18919, 28309.67568, 1261.783784, 605743.2432, 40.65280511, -73.9565277),
 ('LOS ANGELES, CA', 'LOS ANGELES', 'CA', 2426413, 1068202, 324842, 15949, 273829, 1292382, 62684, 280325, 22924, 83153, 312270, 104024, 40600, 19436, 626981, 1273305, 141105, 26989, 12329, 35.33548387, 34.53548387, 36.06129032, 47494.58333, 30073.19355, 1201.766667, 557115.0, 34.04220912, -118.3034679),
 ('MIAMI, FL', 'MIAMI', 'FL', 1820704, 1361009, 363514, 2250, 33144, 1162711, 27137, 322521, 30827, 113990, 231241, 79888, 36586, 15913, 338765, 935326, 91584, 20714, 6969, 38.74074074, 37.12037037, 40.26296296, 51232.90741, 25949.35185, 1260.833333, 243279.6296, 25.7602677, -80.2985105)]

## fetchmany() method

In [41]:
engine.execute("SELECT * FROM Census_Data").fetchmany(3)

[('HOUSTON, TX', 'HOUSTON', 'TX', 3061887, 1775897, 684416, 11586, 230549, 1368287, 54180, 387082, 62520, 100014, 349920, 138882, 42491, 27737, 633609, 1593803, 122895, 67484, 22637, 33.43958333, 32.55, 34.36354167, 56206.5, 32239.52083, 956.7083333, 178233.6842, 29.77573444, -95.41454828),
 ('CHICAGO, IL', 'CHICAGO', 'IL', 2702091, 1318869, 843633, 7554, 161478, 785374, 32800, 370569, 50202, 100972, 385664, 178511, 54636, 26956, 588639, 1439118, 173087, 45864, 18209, 34.52678571, 33.79821429, 35.14107143, 57735.96429, 38730.83929, 1119.928571, 264739.2857, 41.86783754, -87.67343993),
 ('BROOKLYN, NY', 'BROOKLYN', 'NY', 2595259, 1126111, 870465, 8744, 297890, 509243, 48934, 389177, 65899, 107313, 348413, 164826, 39328, 17446, 597404, 1297832, 129667, 33644, 14845, 35.17567568, 33.36756757, 36.57837838, 51469.18919, 28309.67568, 1261.783784, 605743.2432, 40.65280511, -73.9565277)]

## fetchone( ) method

In [42]:
engine.execute("SELECT * FROM Census_Data").fetchone()

('HOUSTON, TX', 'HOUSTON', 'TX', 3061887, 1775897, 684416, 11586, 230549, 1368287, 54180, 387082, 62520, 100014, 349920, 138882, 42491, 27737, 633609, 1593803, 122895, 67484, 22637, 33.43958333, 32.55, 34.36354167, 56206.5, 32239.52083, 956.7083333, 178233.6842, 29.77573444, -95.41454828)

# 5 To get the table info for sqlite database, such as columns

In [48]:
data = engine.execute("PRAGMA table_info(Census_Data)")
i = 0
for record in data:
    i += 1
    if i > 5: break
    print(record)

(0, 'CityState', 'text', 0, None, 0)
(1, 'city', 'text', 0, None, 0)
(2, 'state', 'text', 0, None, 0)
(3, 'Population', 'integer', 0, 'NULL', 0)
(4, 'White Population', 'integer', 0, 'NULL', 0)

#  6 Pandas integrates with SQLAlchemy

## Use engine directly
- engine would release connection automatically

In [51]:
data = pd.read_sql("SELECT * FROM Census_Data", engine)
data.head()

,CityState,city,state,Population,White Population,Black Population,Native American Population,Asian Population,Hispanic Population,Education None,...,Employment Female Computer Engineering,Median Age,Median Male Age,Median Female Age,Household Income,Income Per Capita,Median Gross Rent,Median Home Value,lat,lng
0,"HOUSTON, TX",HOUSTON,TX,3061887,1775897,684416,11586,230549,1368287,54180,...,22637,33.439583,32.550000,34.363542,56206.50000,32239.52083,956.708333,178233.6842,29.775734,-95.414548
1,"CHICAGO, IL",CHICAGO,IL,2702091,1318869,843633,7554,161478,785374,32800,...,18209,34.526786,33.798214,35.141071,57735.96429,38730.83929,1119.928571,264739.2857,41.867838,-87.673440
2,"BROOKLYN, NY",BROOKLYN,NY,2595259,1126111,870465,8744,297890,509243,48934,...,14845,35.175676,33.367568,36.578378,51469.18919,28309.67568,1261.783784,605743.2432,40.652805,-73.956528
3,"LOS ANGELES, CA",LOS ANGELES,CA,2426413,1068202,324842,15949,273829,1292382,62684,...,12329,35.335484,34.535484,36.061290,47494.58333,30073.19355,1201.766667,557115.0000,34.042209,-118.303468
4,"MIAMI, FL",MIAMI,FL,1820704,1361009,363514,2250,33144,1162711,27137,...,6969,38.740741,37.120370,40.262963,51232.90741,25949.35185,1260.833333,243279.6296,25.760268,-80.298511

## Use engine.connect()
- connect would NOT release the connection automatically
- Would have to release the connection manually

In [53]:
conn = engine.connect()
data = pd.read_sql("SELECT * FROM Census_Data", conn)
data.head()

,CityState,city,state,Population,White Population,Black Population,Native American Population,Asian Population,Hispanic Population,Education None,...,Employment Female Computer Engineering,Median Age,Median Male Age,Median Female Age,Household Income,Income Per Capita,Median Gross Rent,Median Home Value,lat,lng
0,"HOUSTON, TX",HOUSTON,TX,3061887,1775897,684416,11586,230549,1368287,54180,...,22637,33.439583,32.550000,34.363542,56206.50000,32239.52083,956.708333,178233.6842,29.775734,-95.414548
1,"CHICAGO, IL",CHICAGO,IL,2702091,1318869,843633,7554,161478,785374,32800,...,18209,34.526786,33.798214,35.141071,57735.96429,38730.83929,1119.928571,264739.2857,41.867838,-87.673440
2,"BROOKLYN, NY",BROOKLYN,NY,2595259,1126111,870465,8744,297890,509243,48934,...,14845,35.175676,33.367568,36.578378,51469.18919,28309.67568,1261.783784,605743.2432,40.652805,-73.956528
3,"LOS ANGELES, CA",LOS ANGELES,CA,2426413,1068202,324842,15949,273829,1292382,62684,...,12329,35.335484,34.535484,36.061290,47494.58333,30073.19355,1201.766667,557115.0000,34.042209,-118.303468
4,"MIAMI, FL",MIAMI,FL,1820704,1361009,363514,2250,33144,1162711,27137,...,6969,38.740741,37.120370,40.262963,51232.90741,25949.35185,1260.833333,243279.6296,25.760268,-80.298511

## Import declarative_base

In [ ]:
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

# 7 SQLALchemy with Classes
- update a SQL database using Python classe
- Python classes are traditionally used to bundle data and functions together
- In SQLAlchemy they are used to define structures

## Import declarative_base¶

In [94]:
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

In [95]:
from sqlalchemy import Column, Integer, String, Float

## Create Dog and Cat Classes

In [96]:
class Dog(Base):
    __tablename__ = 'dog'
    id = Column(Integer, primary_key=True)
    name = Column(String(255))
    color = Column(String(255))
    age = Column(Integer)

class Cat(Base):
    __tablename__ = 'cat'
    id = Column(Integer, primary_key=True)
    name = Column(String(255))
    color = Column(String(255))
    age = Column(Integer)

## Create a Specific Instance of the Dog and Cat classes

In [97]:
dog = Dog(name="Fido", color='Brown', age=4)
cat = Cat(name="Whiskers", color="Gray", age=7)

## Create Database Connection

In [98]:
database_path = "pets_db"
engine = create_engine(f"sqlite:///{database_path}")
conn = engine.connect()

## Create a "Metadata" Layer That Abstracts our SQL Database

In [99]:
Base.metadata.create_all(engine)

# Use this to clear out the db
# ----------------------------------
# Base.metadata.drop_all(engine)

## Create a Session Object to Connect to DB

In [100]:
from sqlalchemy.orm import Session
session = Session(bind=engine)

## Add Records to the Appropriate DB

In [101]:
session.add(dog)
session.add(cat)
session.commit()

In [102]:
dog = Dog(name='Rex', color='Brown', age=4)
cat = Cat(name="Felix", color="Gray", age=7)
session.add(dog)
session.add(cat)
session.commit()

# 8 Query a database using python¶

## Query the tables

In [103]:
dog_list = session.query(Dog)
for doggy in dog_list:
    print(doggy.name)

Fido
Fido
Rex

## The result type is Query

In [104]:
type(dog_list)

sqlalchemy.orm.query.Query

## all( ) method to change query object to list

In [109]:
data = session.query(Cat).all()
data

[<__main__.Cat at 0x7f817932f220>,
 <__main__.Cat at 0x7f817932f880>,
 <__main__.Cat at 0x7f8179326c10>]

# 9 Python Class

## Define a class
## Utilize the Python constructor __init__( ) to initialize the object

In [82]:
class Dog():
        def __init__(self, name, color):
            self.name = name
            self.color = color

## Create an instance of a class

In [84]:
dog = Dog('Fido', 'brown')
print(dog.name)
print(dog.color)

Fido
brown

## Class with method
## Class as parameter in another class

In [88]:
# Define the Film class
class Film():

    # A required function to initialize the class object
    def __init__(self, name, length, release_year, language):
        self.name = name
        self.length = length
        self.release_year = release_year
        self.language = language

# An object belonging to the Film class
star_wars = Film("Star Wars", 121, 1977, "English")

In [89]:
# Define the Expert class
class Expert():
    
    # A required function to initialize the class object
    def __init__(self, name):
        self.name = name

    # A method that takes another object as its argument
    def boast(self, obj):

        # Print out Expert object's name
        print("Hi. My name is", self.name)
        
        # Print out the name of the Film class object
        print("I know a lot about", obj.name)
        print("It is", obj.length, "minutes long")
        print("It was released in", obj.release_year)
        print("It is in", obj.language)

In [90]:
# An object belonging to the Film class
superfan = Expert("George Lucas")

In [91]:
superfan.boast(star_wars)

Hi. My name is George Lucas
I know a lot about Star Wars
It is 121 minutes long
It was released in 1977
It is in English